HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/smc_gen/r_s12ad_rx/src/r_s12ad_rx_private.h
/***********************************************************************************************************************
* Copyright (c) 2013 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
***********************************************************************************************************************/
/******************************************************************************
* File Name    : r_s12ad_rx_private.h
* Description  : Definitions and structures used internally by the driver.
*******************************************************************************/
/******************************************************************************
* History : DD.MM.YYYY Version Description
*           22.07.2013 1.00    Initial Release.
*           21.04.2014 1.20    Updated for RX210 advanced features; RX110/63x support.
*           06.11.2014 1.40    Added RX113 support.
*           20.05.2015 1.50    Added RX231 support.
*           01.03.2016 2.11    Added RX130 and RX230 support.
*           01.10.2016 2.20    Added RX65x support.
*           03.04.2017 2.30    Added RX65N-2MB and RX130-512KB support.
*           03.09.2018 3.00    Added RX66T support.
*           28.12.2018 3.10    Added RX72T support.
*                              Added RX65N 64pins support.
*           05.04.2019 4.00    Deleted the bellow macro definition of RX210, RX631, and RX63N.
*                              - ADC_PRV_INVALID_CH_MASK
*                              Added support for GNUC and ICCRX.
*           28.06.2019 4.10    Added RX23W support.
*           31.07.2019 4.20    Added RX72M support.
*           30.08.2019 4.30    Added RX13T support.
*           22.11.2019 4.40    Added RX66N and RX72N support.
*           28.02.2020 4.50    Added RX23E-A support.
*           10.06.2020 4.60    Added RX23T and RX24T and RX24U support.
*           01.03.2021 4.70    Added RX72M 144pins and 100pins support.
*                              Added RX23W 83pins support.
*           31.05.2021 4.80    Added RX671 support.
*           30.07.2021 4.90    Added RX140 support.
*           30.11.2021 4.93    Added RX66T 48pins support.
*           29.12.2021 5.00    Added RX660 support.
*           01.08.2022 5.10    Added RX26T support.
*           14.10.2022 5.20    Added RX23E-B support.
*           03.04.2023 5.30    Added RX26T 48k support.
*           13.02.2024 5.40    Added RX260 and RX261 support.
*           20.03.2025 5.41    Changed the disclaimer in program sources.
*           13.07.2025 5.50    Added RX14T support.
*******************************************************************************/

#ifndef S12AD_PRV_PRIVATE_H
#define S12AD_PRV_PRIVATE_H

/******************************************************************************
Includes   <System Includes> , "Project Includes"
*******************************************************************************/
#include "platform.h"
#include "r_s12ad_rx_if.h"

/******************************************************************************
Macro definitions
*******************************************************************************/

#if R_BSP_VERSION_MAJOR < 5
    #error "This module must use BSP module of Rev.5.00 or higher. Please use the BSP module of Rev.5.00 or higher."
#endif

/* Macro for accessing RX64M/RX65x/RX66T/RX71M/RX72T/RX24T/RX24U/RX671 data register pointers for 
 a given unit (0, 1 or 2) */
#if (defined(BSP_MCU_RX66T)   || defined(BSP_MCU_RX72T) || defined(BSP_MCU_RX24T) \
    || defined(BSP_MCU_RX24U) || defined(BSP_MCU_RX26T))
#define ADC_PRV_GET_DATA_ARR(x)     (((x)==0) ? gp_dreg0_ptrs : \
                                    ((x)==1) ? gp_dreg1_ptrs : \
                                                gp_dreg2_ptrs)
#else
#define ADC_PRV_GET_DATA_ARR(x)         (((x)==0) ? gp_dreg0_ptrs : gp_dreg1_ptrs)
#endif /* #if (defined(BSP_MCU_RX66T) || defined(BSP_MCU_RX72T) || defined(BSP_MCU_RX671)) */

#if (defined(BSP_MCU_RX110) || defined(BSP_MCU_RX111))

#if BSP_PACKAGE_PINS == 64

/* valid: 1111 1111 0101 1111; invalid 0000 0000 1010 0000 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFFF00A0)

#elif BSP_PACKAGE_PINS == 48

/* valid: 1001 1111 0100 0111; invalid 0110 0000 1011 1000 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFFF60B8)

#elif BSP_PACKAGE_PINS == 40

/* valid: 0001 1111 0100 0110; invalid 1110 0000 1011 1001 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFFFE0B9)

#elif BSP_PACKAGE_PINS == 36

/* valid: 0001 1111 0000 0110; invalid 1110 0000 1111 1001 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFFFE0F9)

#else
    #error "ERROR - BSP_CFG_MCU_PART_PACKAGE - Unknown package chosen in r_bsp_config.h"
#endif  /*  */

#endif


#ifdef BSP_MCU_RX113

#if BSP_PACKAGE_PINS == 100

/* valid: 0010 0000 1111 1111 1111 1111; invalid 1101 1111 0000 0000 0000 0000 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFDF0000)

#elif BSP_PACKAGE_PINS == 64

/* valid: 1111 1111 0000 0111; invalid 0000 0000 1111 1000 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFFF00F8)

#else
    #error "ERROR - BSP_CFG_MCU_PART_PACKAGE - Unknown package chosen in r_bsp_config.h"
#endif /* #if BSP_PACKAGE_PINS == 100 */

#endif


#ifdef BSP_MCU_RX130

/* Temp sensor and internal v ref are in bit locations 8 and 9 in each mask for rx130 */
#if BSP_PACKAGE_PINS == 100

/* valid: 1111 1111 1111 1111 0000 0011 1111 1111; invalid 0000 0000 0000 0000 1111 1100 0000 0000 */
#define ADC_PRV_INVALID_CH_MASK     (0x0000FC00)

#elif BSP_PACKAGE_PINS == 80

/* valid: 0000 0111 0011 1111 0000 0011 1111 1111; invalid 1111 1000 1100 0000 1111 1100 0000 0000 */
#define ADC_PRV_INVALID_CH_MASK     (0xF8C0FC00)

#elif BSP_PACKAGE_PINS == 64

/* valid: 0000 0000 0011 1111 0000 0011 1111 1111; invalid 1111 1111 1100 0000 1111 1100 0000 0000 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFC0FC00)

#elif BSP_PACKAGE_PINS == 48

/* valid: 0000 0000 0001 1110 0000 0011 1110 0111; invalid 1111 1111 1110 0001 1111 1100 0001 1000 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFE1FC18)
#else
    #error "ERROR - BSP_CFG_MCU_PART_PACKAGE - Unknown package chosen in r_bsp_config.h"
#endif /* #if BSP_PACKAGE_PINS == 100 */

#endif


