HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/smc_gen/r_s12ad_rx/src/r_s12ad_rx_private.h
#ifdef BSP_MCU_RX13T

/* Internal v ref are in bit location 8 in each mask for rx130 */
#if BSP_PACKAGE_PINS == 48

/* valid: 0000 0000 0000 0000 0000 0001 1111 1111; invalid 1111 1111 1111 1111 1111 1110 0000 0000 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFFFFE00)

#elif BSP_PACKAGE_PINS == 32

/* valid: 0000 0000 0000 0000 0000 0001 0001 1111; invalid 1111 1111 1111 1111 1111 1110 1110 0000 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFFFFEE0)

#else
    #error "ERROR - BSP_CFG_MCU_PART_PACKAGE - Unknown package chosen in r_bsp_config.h"
#endif  /* BSP_PACKAGE_PINS == 48 */

#endif



#ifdef BSP_MCU_RX140

/* Temp sensor and internal v ref are in bit locations 9 and 10 in each mask for rx140 */
#if BSP_PACKAGE_PINS == 80

/* valid: 0000 0111 0011 1111 0000 0111 1111 1111; invalid 1111 1000 1100 0000 1111 1000 0000 0000 */
#define ADC_PRV_INVALID_CH_MASK     (0xF8C0F800)

#elif BSP_PACKAGE_PINS == 64

/* valid: 0000 0000 0011 1111 0000 0111 1111 1111; invalid 1111 1111 1100 0000 1111 1000 0000 0000 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFC0F800)

#elif BSP_PACKAGE_PINS == 48

/* valid: 0000 0000 0001 1110 0000 0111 1110 0111; invalid 1111 1111 1110 0001 1111 1000 0001 1000 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFE1F818)

#elif BSP_PACKAGE_PINS == 32

/* valid: 0000 0000 0001 1110 0000 0111 1110 0111; invalid 1111 1111 1110 0001 1111 1000 1111 1000 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFE1F8F8)

#else
    #error "ERROR - BSP_CFG_MCU_PART_PACKAGE - Unknown package chosen in r_bsp_config.h"
#endif /* #if BSP_PACKAGE_PINS == 80 */

#endif


#ifdef BSP_MCU_RX230

/* Temp sensor and internal v ref are in bit locations 8 and 9 in each mask for rx230 */
#if BSP_PACKAGE_PINS == 100

/* valid: 1111 1111 1111 1111 0000 0011 1111 1111; invalid 0000 0000 0000 0000 1111 1100 0000 0000 */
#define ADC_PRV_INVALID_CH_MASK     (0x0000FC00)

#elif BSP_PACKAGE_PINS == 64

/* valid: 0000 0000 0011 1111 0000 0011 0101 1111; invalid 1111 1111 1100 0000 1111 1100 1010 0000 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFC0FCA0)

#elif BSP_PACKAGE_PINS == 48

/* valid: 0000 0000 0001 1110 0000 0011 0100 0111; invalid 1111 1111 1110 0001 1111 1100 1011 1000 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFE1FCB8)
#else
    #error "ERROR - BSP_CFG_MCU_PART_PACKAGE - Unknown package chosen in r_bsp_config.h"
#endif  /* BSP_PACKAGE_PINS == 100 */

#endif


#ifdef BSP_MCU_RX231

/* Temp sensor and internal v ref are in bit locations 8 and 9 in each mask for rx231 */
#if BSP_PACKAGE_PINS == 100

/* valid: 1111 1111 1111 1111 0000 0011 1111 1111; invalid 0000 0000 0000 0000 1111 1100 0000 0000 */
#define ADC_PRV_INVALID_CH_MASK     (0x0000FC00)

#elif BSP_PACKAGE_PINS == 64

/* valid: 0000 0000 0011 1111 0000 0011 0101 1111; invalid 1111 1111 1100 0000 1111 1100 1010 0000 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFC0FCA0)

#elif BSP_PACKAGE_PINS == 48

/* valid: 0000 0000 0001 1110 0000 0011 0100 0111; invalid 1111 1111 1110 0001 1111 1100 1011 1000 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFE1FCB8)
#else
    #error "ERROR - BSP_CFG_MCU_PART_PACKAGE - Unknown package chosen in r_bsp_config.h"
#endif /* BSP_PACKAGE_PINS == 100 */

#endif


#ifdef BSP_MCU_RX23T

/* Internal v ref are in bit location 8 in each mask for rx23t */
#if BSP_PACKAGE_PINS == 64

/* valid: 0000 0000 0000 0011 0000 0001 1111 1111; invalid 1111 1111 1111 1100 1111 1110 0000 0000 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFFCFE00)

#elif BSP_PACKAGE_PINS == 52

/* valid: 0000 0000 0000 0011 0000 0001 1111 1111; invalid 1111 1111 1111 1100 1111 1110 0000 0000 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFFCFE00)

#elif BSP_PACKAGE_PINS == 48

/* valid: 0000 0000 0000 0011 0000 0001 1111 1111; invalid 1111 1111 1111 1100 1111 1110 0000 0000 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFFCFE00)
#else
    #error "ERROR - BSP_CFG_MCU_PART_PACKAGE - Unknown package chosen in r_bsp_config.h"
#endif /* BSP_PACKAGE_PINS == 64 */

#endif


#ifdef BSP_MCU_RX23E_A

#if BSP_PACKAGE_PINS == 48
/* valid: 0000 0000 0000 0000 0000 0011 1111 1111; invalid 1111 1111 1111 1111 1111 1111 1100 0000 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFFFFFC0)

#elif BSP_PACKAGE_PINS == 40

/* valid: 0000 1000 0001 1100 0000 0011 1110 0010; invalid 1111 1111 1110 1111 1111 1111 1111 0000 */
#define ADC_PRV_INVALID_CH_MASK     (0xFFFFFFF0)

#else
    #error "ERROR - BSP_CFG_MCU_PART_PACKAGE - Unknown package chosen in r_bsp_config.h"
#endif  /* BSP_PACKAGE_PINS == 48 */

#endif

#ifdef BSP_MCU_RX23W

/* Temp sensor and internal v ref are in bit locations 8 and 9 in each mask for rx23w */
#if BSP_PACKAGE_PINS == 85
/* valid: 0000 1000 0001 1111 0000 0011 1111 1111; invalid 1111 0111 1110 0000 1111 1100 0000 0000 */
#define ADC_PRV_INVALID_CH_MASK     (0xF7E0FC00)

#elif BSP_PACKAGE_PINS == 83
/* valid: 0000 1000 0001 1111 0000 0011 1111 1111; invalid 1111 0111 1110 0000 1111 1100 0000 0000 */
#define ADC_PRV_INVALID_CH_MASK     (0xF7E0FC00)

#elif BSP_PACKAGE_PINS == 56

/* valid: 0000 1000 0001 1100 0000 0011 1110 0010; invalid 1111 0111 1110 0011 1111 1100 0001 1101 */
#define ADC_PRV_INVALID_CH_MASK     (0xF7E3FC1D)

#else
    #error "ERROR - BSP_CFG_MCU_PART_PACKAGE - Unknown package chosen in r_bsp_config.h"
#endif  /* BSP_PACKAGE_PINS == 85 */

#endif

#ifdef BSP_MCU_RX24T

/* Internal v ref are in bit location 12 in mask2 for rx24t */
#if BSP_PACKAGE_PINS == 100

#define ADC_PRV_INVALID_CH_MASK0    (0xFFFEFFF0)    /* all channels valid (0-3,16) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFFFEFFF0)    /* all channels valid (0-3,16) */
#define ADC_PRV_INVALID_CH_MASK2    (0xFFFFE000)    /* all channels valid (0-11, sensors) */

#elif BSP_PACKAGE_PINS == 80

#define ADC_PRV_INVALID_CH_MASK0    (0xFFFEFFF0)    /* all channels valid (0-3,16) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFFFEFFF0)    /* all channels valid (0-3,16) */
#define ADC_PRV_INVALID_CH_MASK2    (0xFFFFE0C4)    /* all channels valid (2,6-11, sensors) */

#elif BSP_PACKAGE_PINS == 64

#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFFF8)    /* all channels valid (0-2) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFFFEFFF8)    /* all channels valid (0-2,16) */
#define ADC_PRV_INVALID_CH_MASK2    (0xFFFFE83F)    /* all channels valid (6-10, sensors) */

#else
    #error "ERROR - BSP_CFG_MCU_PART_PACKAGE - Unknown package chosen in r_bsp_config.h"
#endif  /* BSP_PACKAGE_PINS == 100 */

#endif

