HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/smc_gen/r_s12ad_rx/src/r_s12ad_rx_private.h
#ifdef BSP_MCU_RX24U

/* Internal v ref are in bit location 12 in mask2 for rx24u */
#if BSP_PACKAGE_PINS == 144

#define ADC_PRV_INVALID_CH_MASK0    (0xFFFEFFF0)    /* all channels valid (0-3,16) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFFFEFFF0)    /* all channels valid (0-3,16) */
#define ADC_PRV_INVALID_CH_MASK2    (0xFFFFE000)    /* all channels valid (0-11, sensors) */

#elif BSP_PACKAGE_PINS == 100

#define ADC_PRV_INVALID_CH_MASK0    (0xFFFEFFF0)    /* all channels valid (0-3,16) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFFFEFFF0)    /* all channels valid (0-3,16) */
#define ADC_PRV_INVALID_CH_MASK2    (0xFFFFE0C0)    /* all channels valid (0-5,8-11, sensors) */

#else
    #error "ERROR - BSP_CFG_MCU_PART_PACKAGE - Unknown package chosen in r_bsp_config.h"
#endif  /* BSP_PACKAGE_PINS == 144 */

#endif

#if (defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M))

#if BSP_PACKAGE_PINS == 177
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF800000)    /* all channels valid (0-20, sensors) */

#elif BSP_PACKAGE_PINS == 176
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF800000)    /* all channels valid (0-20, sensors) */

#elif BSP_PACKAGE_PINS == 145
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF800000)    /* all channels valid (0-20, sensors) */

#elif BSP_PACKAGE_PINS == 144
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF800000)    /* all channels valid (0-20, sensors) */

#elif BSP_PACKAGE_PINS == 100
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */

/* valid: 0110 0000 0011 1111 1111 1111; invalid 1001 1111 1100 0000 0000 0000 */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF9FC000)    /* chans 0-13, sensors valid */

#else
    #error "ERROR - BSP_CFG_MCU_PART_PACKAGE - Unknown package chosen in r_bsp_config.h"
#endif  /* BSP_PACKAGE_PINS == 177 */

#endif

#if (defined(BSP_MCU_RX65_ALL))

#if BSP_PACKAGE_PINS == 177
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF800000)    /* all channels valid (0-20, sensors) */

#elif BSP_PACKAGE_PINS == 176
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF800000)    /* all channels valid (0-20, sensors) */

#elif BSP_PACKAGE_PINS == 145
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF800000)    /* all channels valid (0-20, sensors) */

#elif BSP_PACKAGE_PINS == 144
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF800000)    /* all channels valid (0-20, sensors) */

#elif BSP_PACKAGE_PINS == 100
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */

/* valid: 0110 0000 0011 1111 1111 1111; invalid 1001 1111 1100 0000 0000 0000 */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF9FC000)    /* chans 0-13, sensors valid */

#elif BSP_PACKAGE_PINS == 64
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFFF0)    /* channels 0-3 valid */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF9FC33F)    /* chans 6, 7 10-13, sensors valid */

#else
    #error "ERROR - BSP_CFG_MCU_PART_PACKAGE - Unknown package chosen in r_bsp_config.h"
#endif /* BSP_PACKAGE_PINS == 177 */

#endif /* definedBSP_MCU_RX65_ALL */

#if (defined(BSP_MCU_RX660))

#if BSP_PACKAGE_PINS == 144
#define ADC_PRV_INVALID_CH_MASK0    (0xFC000000)    /* all channels valid (0-23 sensors) */

#elif BSP_PACKAGE_PINS == 100
#define ADC_PRV_INVALID_CH_MASK0    (0xFC000000)    /* all channels valid (0-23 sensors) */

#elif BSP_PACKAGE_PINS == 80
#define ADC_PRV_INVALID_CH_MASK0    (0xFCF8C000)    /* channels 0-13 16-18 sensors valid */

#elif BSP_PACKAGE_PINS == 64
#define ADC_PRV_INVALID_CH_MASK0    (0xFCFFC000)    /* channels 0-13 sensors valid */

#elif BSP_PACKAGE_PINS == 48
#define ADC_PRV_INVALID_CH_MASK0    (0xFCFFE118)    /* channels 0-2 5-7 9-12 sensors valid */

#else
    #error "ERROR - BSP_CFG_MCU_PART_PACKAGE - Unknown package chosen in r_bsp_config.h"
#endif /* BSP_PACKAGE_PINS == 177 */

#endif /* definedBSP_MCU_RX65_ALL */

#if (defined(BSP_MCU_RX66T))

#if BSP_PACKAGE_PINS == 144
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK2    (0xFFF0F000)    /* all channels valid (0-11, 16, 17 sensors) */

#elif BSP_PACKAGE_PINS == 112
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF70)    /* channels 0-3, 7 valid */
#define ADC_PRV_INVALID_CH_MASK1    (0xFFFFFF70)    /* channels 0-3, 7 valid */
#define ADC_PRV_INVALID_CH_MASK2    (0xFFF0F030)    /* channels 0-3, 6-11, 16, 17 sensors valid */

#elif BSP_PACKAGE_PINS == 100

#if ((BSP_CFG_MCU_PART_FUNCTION == 0xA) || \
    (BSP_CFG_MCU_PART_FUNCTION == 0xC) || \
    (BSP_CFG_MCU_PART_FUNCTION == 0xE) || \
    (BSP_CFG_MCU_PART_FUNCTION == 0x10))
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF70)    /* channels 0-3, 7 valid */
#define ADC_PRV_INVALID_CH_MASK1    (0xFFFFFF70)    /* channels 0-3, 7 valid */
#define ADC_PRV_INVALID_CH_MASK2    (0xFFF0F030)    /* channels 0-3, 6-11, 16, 17 sensors valid */
#else
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFFF0)    /* channels 0-3 valid */
#define ADC_PRV_INVALID_CH_MASK1    (0xFFFFFFF0)    /* channels 0-3 valid */
#define ADC_PRV_INVALID_CH_MASK2    (0xFFF0F000)    /* all channels valid (0-11, 16, 17 sensors) */
#endif /* #if ((BSP_CFG_MCU_PART_FUNCTION == 0xA) || \
    (BSP_CFG_MCU_PART_FUNCTION == 0xC) || \
    (BSP_CFG_MCU_PART_FUNCTION == 0xE) || \
    (BSP_CFG_MCU_PART_FUNCTION == 0x10)) */

#elif BSP_PACKAGE_PINS == 80
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF70)    /* channels 0-3, 7 valid */
#define ADC_PRV_INVALID_CH_MASK1    (0xFFFFFF70)    /* channels 0-3, 7 valid */
#define ADC_PRV_INVALID_CH_MASK2    (0xFFF0F2F0)    /* channels 0-3, 8, 10, 11, 16, 17, sensors valid */

#elif BSP_PACKAGE_PINS == 64
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF78)    /* channels 0-2, 7 valid */
#define ADC_PRV_INVALID_CH_MASK1    (0xFFFFFF78)    /* channels 0-2, 7 valid */
#define ADC_PRV_INVALID_CH_MASK2    (0xFFF0F3F8)    /* channels 0-2, 10, 11, 16, 17, sensors valid */

#elif BSP_PACKAGE_PINS == 48
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFFF0)    /* channels 0-3 valid */
#define ADC_PRV_INVALID_CH_MASK1    (0xFFFFFFFE)    /* channels 0 valid */
#define ADC_PRV_INVALID_CH_MASK2    (0xFFF3F2FF)    /* channels 8, 10, 11, sensors valid */

#else
    #error "ERROR - BSP_CFG_MCU_PART_PACKAGE - Unknown package chosen in r_bsp_config.h"
#endif /* BSP_PACKAGE_PINS == 144 */

#endif /* definedBSP_MCU_RX66T */

#if (defined(BSP_MCU_RX671))

