HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/smc_gen/r_s12ad_rx/src/r_s12ad_rx_private.h
#if BSP_PACKAGE_PINS == 145
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFFFFC000)    /* all channels valid (0-11, sensors) */

#elif BSP_PACKAGE_PINS == 144
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFFFFC000)    /* all channels valid (0-11, sensors) */

#elif BSP_PACKAGE_PINS == 100
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFFFFCF00)    /* channels 0-7, sensors valid */

#elif BSP_PACKAGE_PINS == 64
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFFF0)    /* channels 0-3 valid */
#define ADC_PRV_INVALID_CH_MASK1    (0xFFFFCFC0)    /* channels 0-5, sensors valid */

#elif BSP_PACKAGE_PINS == 48
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFFF0)    /* channels 0-3 valid */
#define ADC_PRV_INVALID_CH_MASK1    (0xFFFFCFC3)    /* channels 2-5, sensors valid */

#else
    #error "ERROR - BSP_CFG_MCU_PART_PACKAGE - Unknown package chosen in r_bsp_config.h"
#endif /* BSP_PACKAGE_PINS == 145 */

#endif /* definedBSP_MCU_RX671 */

#if (defined(BSP_MCU_RX72T))

#if BSP_PACKAGE_PINS == 144
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK2    (0xFFF0F000)    /* all channels valid (0-11, 16, 17 sensors) */

#elif BSP_PACKAGE_PINS == 100

#if ((BSP_CFG_MCU_PART_FUNCTION == 0xA) || \
    (BSP_CFG_MCU_PART_FUNCTION == 0xC) || \
    (BSP_CFG_MCU_PART_FUNCTION == 0xE) || \
    (BSP_CFG_MCU_PART_FUNCTION == 0x10))
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF70)    /* channels 0-3, 7 valid */
#define ADC_PRV_INVALID_CH_MASK1    (0xFFFFFF70)    /* channels 0-3, 7 valid */
#define ADC_PRV_INVALID_CH_MASK2    (0xFFF0F030)    /* channels 0-3, 6-11, 16, 17 sensors valid */
#else
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFFF0)    /* channels 0-3 valid */
#define ADC_PRV_INVALID_CH_MASK1    (0xFFFFFFF0)    /* channels 0-3 valid */
#define ADC_PRV_INVALID_CH_MASK2    (0xFFF0F000)    /* all channels valid (0-11, 16, 17 sensors) */
#endif /* #if ((BSP_CFG_MCU_PART_FUNCTION == 0xA) || \
    (BSP_CFG_MCU_PART_FUNCTION == 0xC) || \
    (BSP_CFG_MCU_PART_FUNCTION == 0xE) || \
    (BSP_CFG_MCU_PART_FUNCTION == 0x10)) */

#else
    #error "ERROR - BSP_CFG_MCU_PART_PACKAGE - Unknown package chosen in r_bsp_config.h"
#endif  /* BSP_PACKAGE_PINS == 144 */
#endif

#if (defined(BSP_MCU_RX72M))

#if BSP_PACKAGE_PINS == 224
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF800000)    /* all channels valid (0-20, sensors) */

#elif BSP_PACKAGE_PINS == 176
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF800000)    /* all channels valid (0-20, sensors) */

#elif BSP_PACKAGE_PINS == 144
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFFE0)    /* channels 0-4 valid */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF800000)    /* all channels valid (0-20, sensors) */

#elif BSP_PACKAGE_PINS == 100
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFFF8)    /* channels 0-2  */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF983931)    /* channels 1-3, 6, 7, 9, 10, 14-18, sensors valid */

#else
    #error "ERROR - BSP_CFG_MCU_PART_PACKAGE - Unknown package chosen in r_bsp_config.h"
#endif /* BSP_PACKAGE_PINS == 224 */
#endif

#if (defined(BSP_MCU_RX66N))

#if BSP_PACKAGE_PINS == 224
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF800000)    /* all channels valid (0-20, sensors) */

#elif BSP_PACKAGE_PINS == 176
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF800000)    /* all channels valid (0-20, sensors) */

#elif BSP_PACKAGE_PINS == 145
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF800000)    /* all channels valid (0-20, sensors) */

#elif BSP_PACKAGE_PINS == 144
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF800000)    /* all channels valid (0-20, sensors) */

#elif BSP_PACKAGE_PINS == 100
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF9FC000)    /* chans 0-13, sensors valid */

#else
    #error "ERROR - BSP_CFG_MCU_PART_PACKAGE - Unknown package chosen in r_bsp_config.h"
#endif  /* BSP_PACKAGE_PINS == 224 */
#endif

#if (defined(BSP_MCU_RX72N))

#if BSP_PACKAGE_PINS == 224
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF800000)    /* all channels valid (0-20, sensors) */

#elif BSP_PACKAGE_PINS == 176
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF800000)    /* all channels valid (0-20, sensors) */

#elif BSP_PACKAGE_PINS == 145
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF800000)    /* all channels valid (0-20, sensors) */

#elif BSP_PACKAGE_PINS == 144
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF800000)    /* all channels valid (0-20, sensors) */

#elif BSP_PACKAGE_PINS == 100
#define ADC_PRV_INVALID_CH_MASK0    (0xFFFFFF00)    /* all channels valid (0-7) */
#define ADC_PRV_INVALID_CH_MASK1    (0xFF9FC000)    /* chans 0-13, sensors valid */

#else
    #error "ERROR - BSP_CFG_MCU_PART_PACKAGE - Unknown package chosen in r_bsp_config.h"
#endif  /*  */
#endif


/******************************************************************************
Typedef definitions
*******************************************************************************/
typedef R_BSP_VOLATILE_EVENACCESS uint16_t * const  dregs_t;

